{
  "nav": {
    "home": "Home",
    "about": "About Me",
    "cv": "CV",
    "hobbies": "Hobbies",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "welcome": "Welcome to",
    "title": "Chelsea Norrgård's Portfolio",
    "subtitle": "IT Professional & Registered Nurse from Vaasa, Finland",
    "available": "Available for Work",
    "hello": "Hello & Welcome!",
    "helloText": "Hi, I'm Chelsea Norrgård — an American who somehow ended up in Finland. I traded Seattle rain for Finnish snow (questionable life choice, but hey, the summers are decent). This is my portfolio: part tech, part nursing, part 'how did I get here?' story. Buckle up.",
    "discover": "What You'll Discover",
    "discoverText": "Here you'll find my technical projects, nursing adventures, and hobbies like baking and knitting. Also, fair warning: I’m into modern metalcore, so yes, screaming dudes with guitars are my motivational soundtrack. If that scares you, maybe stick to the knitting section.",
    "explore": "Explore My Journey",
    "exploreText": "My career path is less 'straight line' and more 'rollercoaster with questionable safety checks.' From art to nursing to manufacturing to software development, I’ve collected skills like Pokémon cards. Feel free to poke around—just don’t expect a fairy-tale narrative.",
    "thanks": "Thank You for Visiting!",
    "thanksText": "Thanks for stopping by. Hopefully you’ll find something here that convinces you I’m worth hiring—or at least worth chatting with over coffee.",
    "whyWork": "Why Work With Me?",
    "whyWorkSub": "A unique blend of technical skills and human empathy (with a dash of sarcasm)",
    "technical": "Technical Expertise",
    "technicalDesc": "Modern web development skills with React, JavaScript, and full-stack capabilities",
    "healthcare": "Healthcare Background",
    "healthcareDesc": "Nursing experience brings unique perspective to user-centered design and problem-solving",
    "global": "Global Perspective",
    "globalDesc": "Multicultural experience from USA to Finland, bringing adaptability, fresh insights, and a healthy dose of skepticism"
  },
  "about": {
    "title1": "About",
    "title2": "Me",
    "journey": "My Journey",
    "journeyText1": "My name is Chelsea Norrgård (nee Harris). Originally from Seattle, Washington, USA, I now permanently reside in Vaasa, Finland — because apparently trading endless rain for endless snow seemed like a good idea at the time.",
    "journeyText2": "After graduating from Washington State University with a BA in Fine Arts and a minor in Communications in 2006, I dove headfirst into the thrilling world of bureaucratic office life. I worked at the Department of State and a law firm, where I focused on privacy and legal compliance — because nothing screams excitement like paperwork and red tape.",
    "education": "Education & Growth (or at least survival)",
    "educationText1": "In late 2014, I took a break from corporate monotony to work at a dog grooming shop while juggling community college courses and plotting a move to Finland. By mid-2016, I was accepted into nursing school at Novia University of Applied Sciences in Vaasa, officially sealing my fate. I graduated as a registered nurse in December 2019, proving that sleep deprivation can, in fact, be a lifestyle.",
    "educationText2": "During my nursing career, I worked mostly in elderly care homes and later with children under 6, focusing on severe progressive illnesses and premature birth complications. It was rewarding, sure, but also a constant reminder that empathy is exhausting. Eventually, I decided to switch careers before I burned out completely.",
    "itCareer": "IT Career (because why not?)",
    "itCareerText": "In January 2022, I jumped ship into IT by enrolling in VAMK's program and picking up flexible work at Danfoss on the production line. Despite the chaos of career changes, I’m still sharpening my coding skills and chasing opportunities in tech — because debugging code is somehow less soul‑crushing than bureaucracy or night shifts.",
    "personal": "Personal Life",
    "personalText": "I’m married to Staffan Norrgård, whom I met during nursing school and married in June 2019. We share our home with Lucy, a 14‑year‑old chihuahua who runs the household with an iron paw. In September 2022, I got Finnish citizenship, which means I now have the privilege of complaining about both American and Finnish politics.",
    "quickFacts": "Quick Facts",
    "location": "Location",
    "locationValue": "Vaasa, Finland",
    "educationLabel": "Education",
    "educationValue1": "BA Fine Arts",
    "educationValue2": "BSc Nursing",
    "educationValue3": "BEng Information Technology",
    "citizenship": "Citizenship",
    "citizenshipValue": "Finland & USA",
    "focus": "Focus",
    "focusValue": "IT & Web Development",
    "coreStrengths": "Core Strengths (allegedly)",
    "problemSolving": "Problem Solving",
    "communication": "Communication",
    "empathy": "Empathy",
    "technicalLearning": "Technical Learning",
    "api": "Integrating APIs",
    "linux": "Linux (Ubuntu and Kali)",
    "git": "Version Control (Git)",
    "myLife": "My Life in Photos",
    "myLifeSub": "Moments that matter to me (or at least look good online)",
    "wedding": "Wedding Day",
    "weddingDesc": "Married to Staffan in June 2019",
    "lucy": "My Chihuahua Lucy",
    "lucyDesc": "Tiny dictator, beloved family member",
    "finland": "Beautiful Finland",
    "finlandDesc": "My adopted home country"
  },
  "hobbies": {
    "title1": "My",
    "title2": "Hobbies",
    "baking": "Baking and Cooking",
    "bakingText": "I spend way too much time in the kitchen, making treats that disappear faster than I can photograph them. Experimenting with recipes is fun until you realize 'fun' also means cleaning up.",
    "knitting": "Knitting and Crochet",
    "knittingText1": "Knitting and crochet keep me busy — and by busy, I mean drowning in yarn. My stash could probably qualify as a fire hazard, and yes, I have more projects in progress than I’ll ever finish.",
    "knittingText2": "Here’s a link to my Ravelry page where you can see some proof that I do occaisionally finish things:",
    "quickFacts": "Quick Facts",
    "favoriteTreats": "Favorite Treats To Make",
    "treatsValue": "Tarts, Pies, Conchas, Bread",
    "knittingProjects": "Knitting and Crochet Projects",
    "projectsValue": "Shawls, Socks, Plushies, Sweaters, Beanies",
    "gaming": "Gaming",
    "gamingValue": "PC Games such as GTA, Stardew Valley, Trine, R.E.P.O., 7 Days to Die, and many more",
    "music": "Music",
    "musicValue": "Electric Callboy, Imminence, Bad Omens, Architects, We Butter the Bread with Butter, Lorna Shore"
  },
  "projects": {
    "title": "Projects",
    "whereis": {
      "name": "WhereIs – Personal Inventory Mobile App",
      "description": "Created an Android app that allows users to track personal belongings by storing item names, photos, notes, GPS coordinates, and locations on an interactive map. The app uses Firebase for real-time data storage and photo hosting, ensuring seamless synchronization across devices. Integrated Google Maps API to provide users with a dynamic and intuitive visual representation of their items' locations. Built with React Native and designed for usability with intuitive forms, offline support considerations, and efficient cloud syncing to maintain data integrity."
    },
    "risk": {
      "name": "Risk Simulation Game Enhancement",
      "description": "Led a team project to modernize and expand a basic risk simulation game by refining gameplay logic, redesigning the user interface to improve accessibility, and enhancing overall code quality. As project manager and core contributor, I coordinated task delegation, implemented Excel export features, introduced modular architecture, and integrated new risk logic that incorporated probabilistic behavior over time. Added support for editable risk entries, dynamic UI updates, clearer scoring explanations, and performance logging improvements while keeping the app lightweight and maintainable."
    },
    "cryptoknit": {
      "name": "CryptoKnit – Textile Steganography Portfolio",
      "description": "Developed an interactive web portfolio for my thesis exploring textile steganography with modern and historical cryptography methods. The project demonstrates how secret messages can be encoded in knitting and crochet patterns, combining traditional craft techniques with contemporary encryption algorithms. Built a responsive single-page application to showcase research findings, implementation examples, and visual demonstrations of cryptographic knitting patterns. The portfolio serves as both a technical demonstration and an educational resource on the intersection of fiber arts and information security."
    },
    "viewGithub": "View Project on GitHub"
  },
  "cv": {
    "curriculum": "Curriculum",
    "vitae": "Vitae",
    "resumeType": "Resume Type",
    "resumeTypeDesc": "Select which resume you'd like to view — the general one or the nursing one. Career hopping keeps things interesting.",
    "primaryResume": "Primary Resume",
    "nursingResume": "Nursing Resume",
    "downloadPDF": "Download PDF"
  },
  "resume": {
    "it": {
      "skills": {
        "title": "TECHNICAL SKILLS",
        "point1": "JavaScript, React, Node.js, Python (intermediate), HTML5, CSS3, MongoDB, Firebase, Rust, Figma, Angular.js, Vista Create (formerly Crello), Azure, Git & GitHub (version control), Google Maps API, RESTful APIs, React Native, PowerShell, Angular.js, Power BI, Linux (primarily Kali and Ubuntu)"
      },
      "experience": {
        "title": "WORK EXPERIENCE",
        "danfoss": {
          "title": "Production – Danfoss Drives (via Barona)",
          "location": "Vaasa, Finland | June 2022 – February 2024",
          "point1": "Assembled frequency converters from frame to final product, including circuit boards, SKIIPs, and cabling.",
          "point2": "Performed post-production quality checks using automated test ovens.",
          "point3": "Logged all production steps in SAP, scanning barcodes to ensure traceability.",
          "point4": "Rotated across stations, working both independently and as part of a team."
        },
        "inmedi": {
          "title": "Registered Nurse – InMedi Oy",
          "location": "Vaasa, Finland | October 2020 – June 2022",
          "point1": "Provided overnight pediatric and hospice care for severely ill children, working independently in high-responsibility situations.",
          "point2": "Documented all care activities to ensure accurate and seamless handover to day teams.",
          "point3": "Maintained clear communication with families and care teams to support continuity of care."
        },
        "bishop": {
          "title": "Lead Foreclosure Clerk – Bishop, White, Marshall & Weibel",
          "location": "Seattle, WA USA | October 2012 – November 2014",
          "point1": "Supervised the File Opening Department and served as liaison between banks and internal processing teams.",
          "point2": "Conducted initial case checks, including property, financial, and judicial records.",
          "point3": "Designed and implemented an office-wide electronic tracking system, replacing a paper-based workflow and improving file traceability.",
          "point4": " Trained new staff and streamlined referral workflows through digital process improvements."
        },
        "state": {
          "title": "Communications Specialist – Department of State",
          "location": "Seattle, WA USA | March 2007 – July 2012",
          "point1": "Acted as liaison between applicants, passport acceptance agents, and internal adjudication officers.",
          "point2": "Managed emergency passport requests, call support, and front-desk interactions.",
          "point3": "Handled mail intake and outgoing correspondence, including suspension letters for incomplete applications.",
          "point4": "Edited the monthly newsletter for acceptance agents across the region."
        }
      }
    },
    "nursing": {
      "skills": {
        "title": "SKILLS",
        "skill1": "First Aid",
        "skill2": "Aseptic Technique",
        "skill3": "IV Cannulation",
        "skill4": "Medication Management",
        "skill5": "Elderly Care",
        "skill6": "Ergonomics",
        "skill7": "Patient Hygiene",
        "skill8": "Vital Signs Monitoring",
        "skill9": "Wound Care",
        "skill10": "Injections",
        "skill11": "Blood Glucose Monitoring",
        "skill12": "Stoma Care",
        "skill13": "Feeding Tube Management (PEG)",
        "skill14": "Oxygen Therapy",
        "skill15": "Airway Suctioning",
        "skill16": "Tracheostomy Care",
        "skill17": "Intravenous Infusion",
        "skill18": "Venipuncture",
        "skill19": "Diagnostic Tests"
      },
      "experience": {
        "title": "WORK EXPERIENCE",
        "inmedi": {
          "title": "InMedi Oy",
          "location": "Vaasa, Finland | October 2020 – June 2022",
          "description": "Night-shift nurse caring for children and premature infants with severe, rare illnesses. Responsibilities included respiratory monitoring and treatments, medication administration, PEG feeding, and maintaining overall patient well-being."
        },
        "esperi": {
          "title": "Esperi Care Home",
          "location": "Vaasa, Finland | October 2019 – January 2020",
          "description": "Temporary position as a nurse, providing basic care for 30 patients across two wards."
        },
        "elvira": {
          "title": "Elvira Assisted Living Facility",
          "location": "Korsholm, Finland | May 2019 – August 2019",
          "description": "Summer substitute nurse, responsible for basic care of 24 patients across two wards."
        },
        "hospital": {
          "title": "Vaasa Central Hospital, Various Wards",
          "location": "Vaasa, Finland | August 2018 – October 2018, January 2019 – April 2019, August 2019 – September 2019",
          "description": "Clinical placements including oncology, day surgery, surgical inpatient unit, surgical outpatient clinic, dialysis, home care services, day unit, and mental health rehabilitation."
        },
        "training": {
          "title": "Carl & Carolina Nursing Home and Himalaja Service House",
          "location": "Vaasa, Finland | May 2017 – June 2017, February 2018 – March 2018",
          "description": "Internships covering basic nursing care, nursing home operations, and clinical training such as blood sampling, vital signs monitoring, ostomy care, wound care, and medication management."
        }
      }
    },
    "education": {
      "title": "EDUCATION",
      "vamk": {
        "title": "Vaasa University of Applied Sciences",
        "location": "Vaasa, Finland | September 2022 - Expected December 2025/January 2026",
        "degree": "Bachelor of Engineering in Information Technology"
      },
      "eduvamia": {
        "title": "Oy Eduvamia Ab",
        "location": "Vaasa, Finland | 2020",
        "program": "Integration Training",
        "details": "Concurrently completed Finnish for Nurses (Sairaanhoitajan Suomi) and earned B1 level YKI certificate (Yleiset kielitutkinnot)."
      },
      "novia": {
        "title": "Novia University of Applied Sciences",
        "location": "Vaasa, Finland | September 2016 – December 2019",
        "degree": "Bachelor of Nursing"
      },
      "wsu": {
        "title": "Washington State University",
        "location": "Pullman, WA, USA | September 2002 – December 2006",
        "degree": "Bachelor of Art in Fine Arts and Communications"
        }
      },
    "languages": {
      "title": "LANGUAGES",
      "english": "English (Native)",
      "swedish": "Swedish (Good)",
      "finnish": "Finnish (Satisfactory)"
    }
  },
  "contact": {
    "title": "Contact",
    "getInTouch": "Get in Touch",
    "getInTouchText": "Yes, it's 2025 and people still have to 'get in touch.' Texting or email works best — because let's be honest, nobody likes phone calls anymore. Reach out through the platforms below, and I'll reply."
  }
}