{
  "nav": {
    "home": "Home",
    "about": "About Me",
    "cv": "CV",
    "hobbies": "Hobbies",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "welcome": "Welcome to",
    "title": "Chelsea Norrgård's Portfolio",
    "subtitle": "IT Professional & Registered Nurse from Vaasa, Finland",
    "available": "Available for Work",
    "hello": "Hello & Welcome!",
    "helloText": "Hi, I'm Chelsea Norrgård — an American who somehow ended up in Finland. I traded Seattle rain for Finnish snow (questionable life choice, but hey, the summers are decent). This is my portfolio: part tech, part nursing, part 'how did I get here?' story. Buckle up.",
    "discover": "What You'll Discover",
    "discoverText": "Here you'll find my technical projects, nursing adventures, and hobbies like baking and knitting. Also, fair warning: I’m into modern metalcore, so yes, screaming dudes with guitars are my motivational soundtrack. If that scares you, maybe stick to the knitting section.",
    "explore": "Explore My Journey",
    "exploreText": "My career path is less 'straight line' and more 'rollercoaster with questionable safety checks.' From art to nursing to manufacturing to software development, I’ve collected skills like Pokémon cards. Feel free to poke around—just don’t expect a fairy-tale narrative.",
    "thanks": "Thank You for Visiting!",
    "thanksText": "Thanks for stopping by. Hopefully you’ll find something here that convinces you I’m worth hiring—or at least worth chatting with over coffee.",
    "whyWork": "Why Work With Me?",
    "whyWorkSub": "A unique blend of technical skills and human empathy (with a dash of sarcasm)",
    "technical": "Technical Expertise",
    "technicalDesc": "Modern web development skills with React, JavaScript, and full-stack capabilities",
    "healthcare": "Healthcare Background",
    "healthcareDesc": "Nursing experience brings unique perspective to user-centered design and problem-solving",
    "global": "Global Perspective",
    "globalDesc": "Multicultural experience from USA to Finland, bringing adaptability, fresh insights, and a healthy dose of skepticism"
  },
  "about": {
    "title1": "About",
    "title2": "Me",
    "journey": "My Journey",
    "journeyText1": "My name is Chelsea Norrgård (nee Harris). Originally from Seattle, Washington, USA, I now permanently reside in Vaasa, Finland — because apparently trading endless rain for endless snow seemed like a good idea at the time.",
    "journeyText2": "After graduating from Washington State University with a BA in Fine Arts and a minor in Communications in 2006, I dove headfirst into the thrilling world of bureaucratic office life. I worked at the Department of State and a law firm, where I focused on privacy and legal compliance — because nothing screams excitement like paperwork and red tape.",
    "education": "Education & Growth (or at least survival)",
    "educationText1": "In late 2014, I took a break from corporate monotony to work at a dog grooming shop while juggling community college courses and plotting a move to Finland. By mid-2016, I was accepted into nursing school at Novia University of Applied Sciences in Vaasa, officially sealing my fate. I graduated as a registered nurse in December 2019, proving that sleep deprivation can, in fact, be a lifestyle.",
    "educationText2": "During my nursing career, I worked mostly in elderly care homes and later with children under 6, focusing on severe progressive illnesses and premature birth complications. It was rewarding, sure, but also a constant reminder that empathy is exhausting. Eventually, I decided to switch careers before I burned out completely.",
    "itCareer": "IT Career (because why not?)",
    "itCareerText": "In January 2022, I jumped ship into IT by enrolling in VAMK's program and picking up flexible work at Danfoss on the production line. Despite the chaos of career changes, I’m still sharpening my coding skills and chasing opportunities in tech — because debugging code is somehow less soul‑crushing than bureaucracy or night shifts.",
    "personal": "Personal Life",
    "personalText": "I’m married to Staffan Norrgård, whom I met during nursing school and married in June 2019. We share our home with Lucy, a 14‑year‑old chihuahua who runs the household with an iron paw. In September 2022, I got Finnish citizenship, which means I now have the privilege of complaining about both American and Finnish politics.",
    "quickFacts": "Quick Facts",
    "location": "Location",
    "locationValue": "Vaasa, Finland",
    "educationLabel": "Education",
    "educationValue1": "BA Fine Arts",
    "educationValue2": "BSc Nursing",
    "educationValue3": "BEng Information Technology",
    "citizenship": "Citizenship",
    "citizenshipValue": "Finland & USA",
    "focus": "Focus",
    "focusValue": "IT & Web Development",
    "coreStrengths": "Core Strengths (allegedly)",
    "problemSolving": "Problem Solving",
    "communication": "Communication",
    "empathy": "Empathy",
    "technicalLearning": "Technical Learning",
    "api": "Integrating APIs",
    "linux": "Linux (Ubuntu and Kali)",
    "git": "Version Control (Git)",
    "myLife": "My Life in Photos",
    "myLifeSub": "Moments that matter to me (or at least look good online)",
    "wedding": "Wedding Day",
    "weddingDesc": "Married to Staffan in June 2019",
    "lucy": "My Chihuahua Lucy",
    "lucyDesc": "Tiny dictator, beloved family member",
    "finland": "Beautiful Finland",
    "finlandDesc": "My adopted home country"
  },
  "hobbies": {
    "title1": "My",
    "title2": "Hobbies",
    "baking": "Baking and Cooking",
    "bakingText": "I spend way too much time in the kitchen, making treats that disappear faster than I can photograph them. Experimenting with recipes is fun until you realize 'fun' also means cleaning up.",
    "knitting": "Knitting and Crochet",
    "knittingText1": "Knitting and crochet keep me busy — and by busy, I mean drowning in yarn. My stash could probably qualify as a fire hazard, and yes, I have more projects in progress than I’ll ever finish.",
    "knittingText2": "Here’s a link to my Ravelry page where you can see some proof that I do occaisionally finish things:",
    "quickFacts": "Quick Facts",
    "favoriteTreats": "Favorite Treats To Make",
    "treatsValue": "Tarts, Pies, Conchas, Bread",
    "knittingProjects": "Knitting and Crochet Projects",
    "projectsValue": "Shawls, Socks, Plushies, Sweaters, Beanies",
    "gaming": "Gaming",
    "gamingValue": "PC Games such as GTA, Stardew Valley, Trine, R.E.P.O., 7 Days to Die, and many more",
    "music": "Music",
    "musicValue": "Electric Callboy, Imminence, Bad Omens, Architects, We Butter the Bread with Butter, Lorna Shore"
  },
  "projects": {
    "title": "Projects",
    "whereis": {
      "name": "WhereIs – Personal Inventory Mobile App",
      "description": "Created an Android app that allows users to track personal belongings by storing item names, photos, notes, GPS coordinates, and locations on an interactive map. The app uses Firebase for real-time data storage and photo hosting, ensuring seamless synchronization across devices. Integrated Google Maps API to provide users with a dynamic and intuitive visual representation of their items' locations. Built with React Native and designed for usability with intuitive forms, offline support considerations, and efficient cloud syncing to maintain data integrity."
    },
    "risk": {
      "name": "Risk Simulation Game Enhancement",
      "description": "Led a team project to modernize and expand a basic risk simulation game by refining gameplay logic, redesigning the user interface to improve accessibility, and enhancing overall code quality. As project manager and core contributor, I coordinated task delegation, implemented Excel export features, introduced modular architecture, and integrated new risk logic that incorporated probabilistic behavior over time. Added support for editable risk entries, dynamic UI updates, clearer scoring explanations, and performance logging improvements while keeping the app lightweight and maintainable."
    },
    "cryptoknit": {
      "name": "CryptoKnit – Textile Steganography Portfolio",
      "description": "Developed an interactive web portfolio for my thesis exploring textile steganography with modern and historical cryptography methods. The project demonstrates how secret messages can be encoded in knitting and crochet patterns, combining traditional craft techniques with contemporary encryption algorithms. Built a responsive single-page application to showcase research findings, implementation examples, and visual demonstrations of cryptographic knitting patterns. The portfolio serves as both a technical demonstration and an educational resource on the intersection of fiber arts and information security."
    },
    "viewGithub": "View Project on GitHub"
  },
  "cv": {
    "curriculum": "Curriculum",
    "vitae": "Vitae",
    "resumeType": "Resume Type",
    "resumeTypeDesc": "Select which resume you'd like to view — the general one or the nursing one. Career hopping keeps things interesting.",
    "primaryResume": "Primary Resume",
    "nursingResume": "Nursing Resume",
    "downloadPDF": "Download PDF"
  },
  "resume": {
    "it": {
      "objective": {
        "title": "OBJECTIVE",
        "point1": "Dynamic and dedicated Information Technology student with a diverse background in nursing, law, and government agencies, poised to transition into a career as a Software Engineer.",
        "point2": "Proficient in JavaScript, C, HTML, CSS, and React, with a passion for creating intuitive user experiences and driving innovation in software development.",
        "point3": "Skilled in software testing methodologies, including unit testing, and adept at troubleshooting programming errors.",
        "point4": "A collaborative team player with strong communication skills, committed to delivering high-quality code and supporting organizational growth through continuous learning and agile development practices."
      },
      "skills": {
        "title": "SKILLS",
        "point1": "Open-minded with extensive experience in multicultural environments.",
        "point2": "Native English speaker with B1 level proficiency in Finnish and Swedish.",
        "point3": "Independent worker with strong organizational and confidentiality skills.",
        "point4": "Experienced in creating lean processes through logical evaluation.",
        "point5": "Proficient in Operating Systems, Java, HTML, CSS, C, Front-end Development, Object-Oriented Programming, Application Development, Agile Software Development, Local Area Networks, Telecommunications, Fieldbuses, Electronics, and Digital Electronics.",
        "point6": "Authorized to work in the USA and the EU/Schengen area due to dual citizenship (USA and Finland)."
      },
      "experience": {
        "title": "WORK EXPERIENCE",
        "danfoss": {
          "title": "Production – Danfoss via Barona",
          "location": "Vaasa, Finland | June 2022 – February 2024",
          "point1": "Assembled frequency converters and conducted basic quality assurance testing.",
          "point2": "Maintained production standards and quotas."
        },
        "inmedi": {
          "title": "Registered Nurse – Inmedi Oy",
          "location": "Vaasa, Finland | October 2020 – June 2022",
          "point1": "Provided pediatric and hospice care for severely ill children.",
          "point2": "Acted as a liaison between parents and care team.",
          "point3": "Documented patient care and communicated effectively with team members."
        },
        "bishop": {
          "title": "Lead Foreclosure Clerk – Bishop, White, Marshall & Weibel",
          "location": "Seattle, WA USA | October 2012 – November 2014",
          "point1": "Managed foreclosure referrals and assisted in file compilation.",
          "point2": "Developed process improvements, including an electronic referral reporting system."
        },
        "state": {
          "title": "Passport Processor and Communications Specialist – Department of State",
          "location": "Seattle, WA USA | March 2007 – July 2012",
          "point1": "Processed passports and maintained communication with applicants.",
          "point2": "Assisted adjudication staff with applicant-related tasks.",
          "point3": "Served as a point of contact for applicants and passport acceptance agents."
        }
      },
      "education": {
        "title": "EDUCATION",
        "vamk": {
          "title": "Vaasa University of Applied Sciences",
          "location": "Vaasa, Finland | Expected graduation in 2026",
          "degree": "Currently studying for a Bachelor of Engineering in Information Technology."
        },
        "eduvamia": {
          "title": "Oy Eduvamia Ab",
          "location": "Vaasa, Finland | 2020",
          "program": "Integration Training / Kotoutumiskoulutus",
          "details": "Concurrently completed Finnish for Nurses (Sairaanhoitajan Suomi) and earned B1 level YKI certificate (Yleiset kielitutkinnot)."
        },
        "novia": {
          "title": "Yrkeshögskolan Novia",
          "location": "Vaasa, Finland | 2016 – 2019",
          "degree": "Bachelor of Nursing"
        },
        "wsu": {
          "title": "Washington State University",
          "location": "Pullman, WA, USA | 2002 – 2006",
          "degree": "Bachelor of Art in Fine Arts with a minor in Communication"
        }
      }
    },
    "nursing": {
      "skills": {
        "title": "SKILLS",
        "skill1": "First Aid (FHJ 2)",
        "skill2": "Aseptic Technique",
        "skill3": "IV Cannulation",
        "skill4": "Medication Management",
        "skill5": "Elderly Care",
        "skill6": "Ergonomics",
        "skill7": "Patient Hygiene",
        "skill8": "Vital Signs",
        "skill9": "Wound Care",
        "skill10": "Injections",
        "skill11": "Blood Glucose Monitoring",
        "skill12": "Stoma Care",
        "skill13": "Feeding Tube Management (PEG)",
        "skill14": "Oxygen Therapy",
        "skill15": "Airway Suctioning",
        "skill16": "Tracheostomy Care",
        "skill17": "Intravenous Infusion",
        "skill18": "Venipuncture",
        "skill19": "Diagnostic Tests"
      },
      "experience": {
        "title": "WORK EXPERIENCE",
        "inmedi": {
          "title": "INMEDI OY",
          "location": "Vaasa, Finland | October 2020 – June 2022",
          "description": "Night shift nurse for children and prematurely born infants affected by severe rare disease or lasting birth complications. Treatment includes respiratory monitoring and treatments, medication administration, PEG feeding, and maintaining good general health."
        },
        "esperi": {
          "title": "ESPERI HOIVAKOTI GUSTAV",
          "location": "Vaasa, Finland | October 2019 – January 2020",
          "description": "Temporary nursing position involving basic care for 30 patients across two departments."
        },
        "elvira": {
          "title": "ELVIRA SERVICEBOENDET",
          "location": "Korsholm, Finland | May 2019 – August 2019",
          "description": "Summer substitute nurse role providing basic care for 24 patients across two departments."
        },
        "hospital": {
          "title": "VAASA CENTRAL HOSPITAL VARIOUS WARDS",
          "location": "Vaasa, Finland | August 2018 – October 2018, January 2019 – April 2019, August 2019 – September 2019",
          "description": "Clinical placements covering oncology, day surgery, surgical unit, surgical outpatient clinic, dialysis, home care, day unit, and mental health rehabilitation."
        },
        "training": {
          "title": "CARL & CAROLINA ÅLDERDOMSHEMMET AND HIMALAJA PALVELUTALO",
          "location": "Vaasa, Finland | May 2017 – June 2017, February 2018 – March 2018",
          "description": "Training sessions encompassed basic care, nursing home operations, and medical training such as blood sampling, vital signs monitoring, stoma care, wound care, and medication management."
        }
      },
      "education": {
        "title": "EDUCATION",
        "vamk": {
          "title": "Vaasa University of Applied Sciences",
          "location": "Vaasa, Finland | Expected graduation in 2026",
          "degree": "Currently studying for a Bachelor of Engineering in Information Technology."
        },
        "eduvamia": {
          "title": "Oy Eduvamia Ab",
          "location": "Vaasa, Finland | 2020",
          "program": "Integration Training / Kotoutumiskoulutus",
          "details": "Concurrently completed Finnish for Nurses (Sairaanhoitajan Suomi) and earned B1 level YKI certificate (Yleiset kielitutkinnot)."
        },
        "novia": {
          "title": "Yrkeshögskolan Novia",
          "location": "Vaasa, Finland | 2016 – 2019",
          "degree": "Bachelor of Nursing"
        },
        "wsu": {
          "title": "Washington State University",
          "location": "Pullman, WA, USA | 2002 – 2006",
          "degree": "Bachelor of Art in Fine Arts with a minor in Communication"
        }
      }
    },
    "languages": {
      "title": "LANGUAGES",
      "english": "English – Native Proficiency",
      "swedish": "Swedish – Proficient (B1)",
      "finnish": "Finnish – Proficient (B1)"
    }
  },
  "contact": {
    "title": "Contact",
    "getInTouch": "Get in Touch",
    "getInTouchText": "Yes, it's 2025 and people still have to 'get in touch.' Texting or email works best — because let's be honest, nobody likes phone calls anymore. Reach out through the platforms below, and I'll reply."
  }
}